lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/Bus_SPI.cpp
/*----------------------------------------------------------------------------/
  Lovyan GFX - Graphics library for embedded devices.

Original Source:
 https://github.com/lovyan03/LovyanGFX/

Licence:
 [FreeBSD](https://github.com/lovyan03/LovyanGFX/blob/master/license.txt)

Author:
 [lovyan03](https://twitter.com/lovyan03)

Contributors:
 [ciniml](https://github.com/ciniml)
 [mongonta0716](https://github.com/mongonta0716)
 [tobozo](https://github.com/tobozo)
/----------------------------------------------------------------------------*/
#if defined (ESP_PLATFORM)
#include <sdkconfig.h>

#if defined (CONFIG_IDF_TARGET_ESP32P4)
 #pragma GCC diagnostic push
 #pragma GCC diagnostic ignored "-Wattributes"
#endif

#include "Bus_SPI.hpp"

#if defined ( CONFIG_IDF_TARGET_ESP32 ) || !defined ( CONFIG_IDF_TARGET )
 #define LGFX_SPIDMA_WORKAROUND
#endif

#include "../../misc/pixelcopy.hpp"

#if __has_include (<soc/dport_reg.h>)
  #include <soc/dport_reg.h>
#endif

#include <driver/rtc_io.h>
#include <esp_heap_caps.h>
#include <esp_log.h>

#if defined (ARDUINO) && (defined (CONFIG_IDF_TARGET_ESP32P4) \
 || defined (CONFIG_IDF_TARGET_ESP32C5) || defined (CONFIG_IDF_TARGET_ESP32C6) \
 || defined (CONFIG_IDF_TARGET_ESP32C61))
 #define LGFX_SPI_CLOCK_TAKEOVER
 #if defined (CONFIG_IDF_TARGET_ESP32P4)
  #include <soc/hp_sys_clkrst_reg.h>
 #else
  #include <soc/pcr_reg.h>
 #endif
#endif

#if __has_include (<esp_private/periph_ctrl.h>)
 #include <esp_private/periph_ctrl.h>
#else
 #include <driver/periph_ctrl.h>
#endif

#if defined (ARDUINO) // Arduino ESP32
 #include <soc/periph_defs.h>
 #include <esp32-hal-cpu.h>
#endif
#include <driver/spi_master.h>

#if defined ESP_IDF_VERSION_MAJOR && ESP_IDF_VERSION_MAJOR >= 5
    #include <rom/gpio.h> // dispatched by core
#elif defined ( CONFIG_IDF_TARGET_ESP32S3 ) && __has_include (<esp32s3/rom/gpio.h>)
   #include <esp32s3/rom/gpio.h>  // dispatched by config
#elif defined ( CONFIG_IDF_TARGET_ESP32S2 ) && __has_include (<esp32s2/rom/gpio.h>)
   #include <esp32s2/rom/gpio.h>  // dispatched by config
#elif defined ( CONFIG_IDF_TARGET_ESP32 ) && __has_include (<esp32/rom/gpio.h>)
   #include <esp32/rom/gpio.h>
#else
   #include <rom/gpio.h> // dispatched by core
#endif

#ifndef SPI_PIN_REG
 #define SPI_PIN_REG SPI_MISC_REG
#endif

#if defined (SOC_GDMA_SUPPORTED)  // for C3/C6/C61/S3
 #if __has_include(<soc/gdma_channel.h>)
  #include <soc/gdma_channel.h>
 #elif __has_include(<hal/gdma_channel.h>)
  #pragma GCC diagnostic push
  #pragma GCC diagnostic ignored "-Wattributes"
  #include <hal/gdma_channel.h>
  #pragma GCC diagnostic pop
 #endif
 #if __has_include(<soc/gdma_reg.h>)
  #include <soc/gdma_reg.h>
 #elif __has_include(<soc/axi_dma_reg.h>) // ESP32P4
  #include <soc/axi_dma_reg.h>
  #include <esp_cache.h>
 #elif __has_include(<soc/ahb_dma_reg.h>) // ESP32C61
  #include <soc/ahb_dma_reg.h>
 #endif
 #if __has_include(<soc/gdma_struct.h>)
  #include <soc/gdma_struct.h>
 #elif __has_include(<soc/axi_dma_struct.h>) // ESP32P4
  #include <soc/axi_dma_struct.h>
 #elif __has_include(<soc/ahb_dma_struct.h>) // ESP32C61
  #include <soc/ahb_dma_struct.h>
 #endif
 #if defined AXI_DMA_OUT_LINK1_CH0_REG
  #define DMA_OUT_LINK_CH0_REG       AXI_DMA_OUT_LINK1_CH0_REG
  #define DMA_OUTFIFO_STATUS_CH0_REG AXI_DMA_OUTFIFO_STATUS_CH0_REG
  #define DMA_OUTLINK_START_CH0      AXI_DMA_OUTLINK_START_CH0
  #define DMA_OUTFIFO_EMPTY_CH0      AXI_DMA_OUTFIFO_L3_EMPTY_CH0
  #define SIZE_OF_DMA_OUT_CH (sizeof(axi_dma_out_reg_t))
 #elif defined AHB_DMA_OUT_LINK_CH0_REG
  #define DMA_OUT_LINK_CH0_REG       AHB_DMA_OUT_LINK_CH0_REG
  #define DMA_OUTFIFO_STATUS_CH0_REG AHB_DMA_OUTFIFO_STATUS_CH0_REG
  #define DMA_OUTLINK_START_CH0      AHB_DMA_OUTLINK_START_CH0
  #define DMA_OUTFIFO_EMPTY_CH0      AHB_DMA_OUTFIFO_EMPTY_CH0
  #define SIZE_OF_DMA_OUT_CH (sizeof(AHB_DMA.channel[0]))
  // AHB_DMA 世代のうち C5/C61 は OUT_LINK レジスタが制御ビットのみになり、
  // ディスクリプタアドレスは別レジスタ (チャンネルごとに 4 バイト刻み) へ書く;
  // (同じ AHB_DMA でも H4 はアドレスレジスタをチャンネルブロック内に持つため対象外)
  #if defined (CONFIG_IDF_TARGET_ESP32C5) || defined (CONFIG_IDF_TARGET_ESP32C61)
   #define DMA_OUT_LINK_ADDR_CH0_REG  AHB_DMA_OUT_LINK_ADDR_CH0_REG
  #endif
 #else
  #if __has_include(<soc/gdma_struct.h>)
   #if !defined DMA_OUT_LINK_CH0_REG
    #define DMA_OUT_LINK_CH0_REG       GDMA_OUT_LINK_CH0_REG
    #define DMA_OUTFIFO_STATUS_CH0_REG GDMA_OUTFIFO_STATUS_CH0_REG
    #define DMA_OUTLINK_START_CH0      GDMA_OUTLINK_START_CH0
    #if defined (GDMA_OUTFIFO_EMPTY_L3_CH0)
     #define DMA_OUTFIFO_EMPTY_CH0      GDMA_OUTFIFO_EMPTY_L3_CH0
    #else
     #define DMA_OUTFIFO_EMPTY_CH0      GDMA_OUTFIFO_EMPTY_CH0
    #endif
   #endif
   #define SIZE_OF_DMA_OUT_CH (sizeof(GDMA.channel[0]))
  #endif
 #endif
#endif

#if !defined(gpio_matrix_out) && defined(rom_gpio_matrix_out)
 #define gpio_matrix_out rom_gpio_matrix_out
#endif

#include "common.hpp"

#if defined (CONFIG_IDF_TARGET_ESP32P4)
 #pragma GCC diagnostic pop
#endif

#include <algorithm>

namespace lgfx
{
 inline namespace v1
 {
//----------------------------------------------------------------------------

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Warray-bounds"
  static __attribute__ ((always_inline)) inline void writereg(uint32_t addr, uint32_t value) { *(volatile uint32_t*)addr = value; }
#pragma GCC diagnostic pop

#if defined (LGFX_SPI_CLOCK_TAKEOVER)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-variable"
  struct spi_clock_state_t
  {
    uint32_t saved0 = 0;
    uint32_t saved1 = 0;
    const Bus_SPI* owner = nullptr;
    bool active = false;
  };

  static spi_clock_state_t spi_clock_state[SOC_SPI_PERIPH_NUM];

  static bool spi_clock_host_supported(int spi_host)
  {
#if defined (CONFIG_IDF_TARGET_ESP32P4)
    return spi_host == SPI2_HOST || spi_host == SPI3_HOST;
#else
    return spi_host == SPI2_HOST;
#endif
  }

  static uint32_t spi_clock_output_frequency(uint32_t source_hz, uint32_t requested_hz)
  {
    const uint32_t clock_div = FreqToClockDiv(source_hz, requested_hz);
    if (clock_div & SPI_CLK_EQU_SYSCLK) { return source_hz; }
    const uint32_t pre = VALUE_GET_FIELD(clock_div, SPI_CLKDIV_PRE) + 1u;
    const uint32_t n = VALUE_GET_FIELD(clock_div, SPI_CLKCNT_N) + 1u;
    return source_hz / pre / n;
  }

